In [1]:
import pandas as pd
import numpy as np

In [68]:
data = pd.read_csv(r"C:\Users\ACER\Desktop\Udaanous\Python\Python PDF\Messy data set.csv")

In [69]:
print(data)

     ID     Name         Age               Email    JoinDate    Salary
0     1    Alice          25   alice@example.com  01-01-2020     50000
1     2      Bob          30     bob@example.com  not a date     60000
2     2      Bob          30     bob@example.com  01-02-2020     60000
3     4  Charlie         NaN            charlie@  01-03-2020     70000
4     5    David  Twenty-two                 NaN  01-04-2020       NaN
5     6      Eve          45         eve@example  01-05-2020     90000
6     7    Frank          50  frank@@example.com  01-06-2020    100000
7     8    Grace          55   grace@example.com  01-07-2020  one lakh
8  nine    Heidi          60   heidi@example.com  2020.08.01    120000
9    10      NaN          65      10@example.com  01-09-2020    130000

In [70]:
# Read the raw lines manually
with open(r"C:\Users\ACER\Desktop\Udaanous\Python\Python PDF\Messy data set.csv", 'r', encoding='utf-8') as f:
    lines = f.readlines()

# Split each line by comma
data = [line.strip().split(',') for line in lines]

# Create DataFrame
df = pd.DataFrame(data[1:], columns=data[0])

print(df.head())

  ID     Name         Age              Email    JoinDate Salary
0  1    Alice          25  alice@example.com  01-01-2020  50000
1  2      Bob          30    bob@example.com  not a date  60000
2  2      Bob          30    bob@example.com  01-02-2020  60000
3  4  Charlie                       charlie@  01-03-2020  70000
4  5    David  Twenty-two                     01-04-2020

In [71]:
df

     ID     Name         Age               Email    JoinDate    Salary
0     1    Alice          25   alice@example.com  01-01-2020     50000
1     2      Bob          30     bob@example.com  not a date     60000
2     2      Bob          30     bob@example.com  01-02-2020     60000
3     4  Charlie                        charlie@  01-03-2020     70000
4     5    David  Twenty-two                      01-04-2020
5     6      Eve          45         eve@example  01-05-2020     90000
6     7    Frank          50  frank@@example.com  01-06-2020    100000
7     8    Grace          55   grace@example.com  01-07-2020  one lakh
8  nine    Heidi          60   heidi@example.com  2020.08.01    120000
9    10                   65      10@example.com  01-09-2020    130000

In [72]:
import pandas as pd
import numpy as np

# Convert empty strings to NaN
df.replace('', np.nan, inplace=True)

# Find missing values
missing_data = df.isnull().sum()
print("Missing Data:\n")
print(missing_data)

Missing Data:

ID          0
Name        1
Age         1
Email       1
JoinDate    0
Salary      1
dtype: int64

In [73]:
df['ID'] = pd.to_numeric(df['ID'], errors='coerce')

# Convert Age → numeric
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

# Convert Salary → numeric (handle 'one lakh' etc.)
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Convert JoinDate → datetime
df['JoinDate'] = pd.to_datetime(df['JoinDate'], errors='coerce')

# Name and Email stay as string (object)
df['Name'] = df['Name'].astype(str)
df['Email'] = df['Email'].astype(str)

# ✅ Check the updated types
print(df.dtypes)

# ✅ Optional: Check cleaned DataFrame
print(df)

ID                 float64
Name                object
Age                float64
Email               object
JoinDate    datetime64[ns]
Salary             float64
dtype: object
     ID     Name   Age               Email   JoinDate    Salary
0   1.0    Alice  25.0   alice@example.com 2020-01-01   50000.0
1   2.0      Bob  30.0     bob@example.com        NaT   60000.0
2   2.0      Bob  30.0     bob@example.com 2020-01-02   60000.0
3   4.0  Charlie   NaN            charlie@ 2020-01-03   70000.0
4   5.0    David   NaN                 nan 2020-01-04       NaN
5   6.0      Eve  45.0         eve@example 2020-01-05   90000.0
6   7.0    Frank  50.0  frank@@example.com 2020-01-06  100000.0
7   8.0    Grace  55.0   grace@example.com 2020-01-07       NaN
8   NaN    Heidi  60.0   heidi@example.com        NaT  120000.0
9  10.0      nan  65.0      10@example.com 2020-01-09  130000.0

In [74]:
from sklearn.impute import SimpleImputer

In [75]:
imputer = SimpleImputer(strategy = "mean")

In [81]:
imputer = SimpleImputer(strategy="mean")
imputer.fit(df[["Salary"]])
df[["Salary"]] = imputer.transform(df[["Salary"]])

In [82]:
df.dtypes

ID                 float64
Name                object
Age                float64
Email               object
JoinDate    datetime64[ns]
Salary             float64
dtype: object

In [84]:
unique_ages = df["Age"].unique()
print(unique_ages)

[25. 30. nan 45. 50. 55. 60. 65.]

In [89]:
df["Salary"] = df["Salary"].astype(int)

In [87]:
df.Salary

0     50000
1     60000
2     60000
3     70000
4     85000
5     90000
6    100000
7     85000
8    120000
9    130000
Name: Salary, dtype: int32

In [92]:
df.drop_duplicates(inplace=True)

In [93]:
df

     ID     Name   Age               Email   JoinDate  Salary
0   1.0    Alice  25.0   alice@example.com 2020-01-01   50000
1   2.0      Bob  30.0     bob@example.com        NaT   60000
2   2.0      Bob  30.0     bob@example.com 2020-01-02   60000
3   4.0  Charlie   NaN            charlie@ 2020-01-03   70000
4   5.0    David   NaN                 nan 2020-01-04   85000
5   6.0      Eve  45.0         eve@example 2020-01-05   90000
6   7.0    Frank  50.0  frank@@example.com 2020-01-06  100000
7   8.0    Grace  55.0   grace@example.com 2020-01-07   85000
8   NaN    Heidi  60.0   heidi@example.com        NaT  120000
9  10.0      nan  65.0      10@example.com 2020-01-09  130000